sercankuslu/astromonty/Programms/dsPIC33/TCPIP Demo App/MainDemo.c
		#if defined(WF_CS_TRIS)
			WFEintISR();
		#endif // WF_CS_TRIS
	}

	#if !defined(HI_TECH_C)
	#pragma code lowVector=0x18
	void LowVector(void){_asm goto LowISR _endasm}
	#pragma code highVector=0x8
	void HighVector(void){_asm goto HighISR _endasm}
	#pragma code // Return to default code section
	#endif

// C30 and C32 Exception Handlers
// If your code gets here, you either tried to read or write
// a NULL pointer, or your application overflowed the stack
// by having too many local variables or parameters declared.
#elif defined(__C30__)
	void _ISR __attribute__((__no_auto_psv__)) _AddressError(void)
	{
	    Nop();
		Nop();
	}
	void _ISR __attribute__((__no_auto_psv__)) _StackError(void)
	{
	    Nop();
		Nop();
	}
void __attribute__((__interrupt__,__no_auto_psv__)) _T6Interrupt( void )
{	
    TMR6 = 0x0000;
	TMR8 = 0x0000;
	TMR9 = 0x0000;
    IFS2bits.T6IF = 0; // Clear T3 interrupt flag
}	
#elif defined(__C32__)
	void _general_exception_handler(unsigned cause, unsigned status)
	{
		Nop();
		Nop();
	}
#endif
double LinInt(double x1,double y1,double x2,double y2, double x)
{
	if(x1!=x2) {
		return y1+(y2-y1)*(x-x1)/(x2-x1);
	}else return y1;
}
//
// Main application entry point.
//
#if defined(__18CXX)
void main(void)
#else
int main(void)
#endif
{
	static DWORD t = 0;
	static DWORD d = 0;
	static DWORD dwLastIP = 0;
	
	//volatile DWORD UTCT;
	LATFbits.LATF4 = 0;
	TRISFbits.TRISF4 = 0;	
	// Initialize application specific hardware
	// Для работы A13  его нужно отключить от ADC
	{
		TRISAbits.TRISA12 = 1;
		AD1CON1 = 0;
		AD2CON1 = 0;
		AD1PCFGH = 0xFFFF;
		AD1PCFGL = 0xFFFF;
		AD2PCFGL = 0xFFFF;
	}
	
	
	{
		static double PI = 3.1415926536f;
		static double Mass = 500.0f;
		static double Radius = 2.0f;
		static double pMPower[] = {
			303.3428571429f,
			275.2714285714f,
			241.2f,
			216.0f,
			190.8f,
			165.6f,
			144.0f,
			118.8f,
			79.2f,
			36.0f
		};
		static double MaxV[] = {
			0.004166667,
			0.5,
			1.25,
			2.5,
			3.75,
			5.0,
			6.25,
			7.5,
			8.75,
			10.0,
		};
		static double MaxA[10];
		double RdivMassR2PI = 360.0f/(Mass*Radius*Radius*PI);
		int i;
		static double resY;
		for(i=0;i<10;i++){
			MaxA[i]=pMPower[i]*RdivMassR2PI;
		}
		resY = LinInt(MaxV[0],MaxA[0],MaxV[1],MaxA[1], 0.4);
		
	}
	BYTE Blob[] = {0x01,0x01,0x80};
	WORD BlobLen = sizeof(Blob);
	ProcessClients(0, Blob, &BlobLen);
    
    /*
    // calculate CPU speed  
    T6CON = 0x0002;
	T8CON = 0x0008;
	T9CON = 0x0000;
	PR8=0xFFFF;
	PR9=0xFFFF;
	TMR6 = 0x0000;
	TMR8 = 0x0000;
	TMR9 = 0x0000;	
	IFS2bits.T6IF = 0;
	IEC2bits.T6IE = 1;
	IPC11bits.T6IP = 7;
	T6CONbits.TON = 1;
	T8CONbits.TON = 1;	
	*/
     
	InitializeBoard();	
	
    
	
	#if defined(USE_LCD)
	// Initialize and display the stack version on the LCD
	LCDInit();
	DelayMs(100);
	strcpypgm2ram((char*)LCDText, "TCPStack " TCPIP_STACK_VERSION "  "
		"                ");
	LCDUpdate();
	#endif

	// Initialize stack-related hardware components that may be 
	// required by the UART configuration routines
    TickInit();
	#if defined(STACK_USE_MPFS) || defined(STACK_USE_MPFS2)
	MPFSInit();
	#endif

	// Initialize Stack and application related NV variables into AppConfig.
	InitAppConfig();

    // Initiates board setup process if button is depressed 
	// on startup
	#ifdef bad
    if(BUTTON0_IO == 0u)
    {
		#if defined(EEPROM_CS_TRIS) || defined(SPIFLASH_CS_TRIS)
		// Invalidate the EEPROM contents if BUTTON0 is held down for more than 4 seconds
		DWORD StartTime = TickGet();
		LED_PUT(0x00);
				
		while(BUTTON0_IO == 0u)
		{
			if(TickGet() - StartTime > 4*TICK_SECOND)
			{
				#if defined(EEPROM_CS_TRIS)
			    XEEBeginWrite(0x0000);
			    XEEWrite(0xFF);
			    XEEWrite(0xFF);
			    XEEEndWrite();
			    #elif defined(SPIFLASH_CS_TRIS)
			    SPIFlashBeginWrite(0x0000);
			    SPIFlashWrite(0xFF);
			    SPIFlashWrite(0xFF);
			    #endif
			    
				#if defined(STACK_USE_UART)
				putrsUART("\r\n\r\nBUTTON0 held for more than 4 seconds.  Default settings restored.\r\n\r\n");
				#endif

				LED_PUT(0x0F);
				while((LONG)(TickGet() - StartTime) <= (LONG)(9*TICK_SECOND/2));
				LED_PUT(0x00);
				while(BUTTON0_IO == 0u);
				Reset();
				break;
			}
		}
		#endif

		#if defined(STACK_USE_UART)
        DoUARTConfig();
		#endif
    }
    #endif //bad
	// Initialize core stack layers (MAC, ARP, TCP, UDP) and
	// application modules (HTTP, SNMP, etc.)
    StackInit();

    #if defined(WF_CS_TRIS)
    WF_Connect();
    #endif

	// Initialize any application-specific modules or functions/
	// For this demo application, this only includes the
	// UART 2 TCP Bridge
	#if defined(STACK_USE_UART2TCP_BRIDGE)
	UART2TCPBridgeInit();
	#endif

	#if defined(STACK_USE_ZEROCONF_LINK_LOCAL)
    ZeroconfLLInitialize();
	#endif

	#if defined(STACK_USE_ZEROCONF_MDNS_SD)
	mDNSInitialize(MY_DEFAULT_HOST_NAME);
	mDNSServiceRegister(
		(const char *) "DemoWebServer",	// base name of the service
		"_http._tcp.local",			    // type of the service
		80,				                // TCP or UDP port, at which this service is available
		((const BYTE *)"path=/index.htm"),	// TXT info
		1,								    // auto rename the service when if needed
		NULL,							    // no callback function
		NULL							    // no application context
		);

    mDNSMulticastFilterRegister();			
	#endif

	// Now that all items are initialized, begin the co-operative
	// multitasking loop.  This infinite loop will continuously 
	// execute all stack-related tasks, as well as your own
	// application's functions.  Custom functions should be added
	// at the end of this loop.
    // Note that this is a "co-operative mult-tasking" mechanism
    // where every task performs its tasks (whether all in one shot
    // or part of it) and returns so that other tasks can do their
    // job.
    // If a task needs very long time to do its job, it must be broken
    // down into smaller pieces so that other tasks can have CPU time.
    while(1)
    {
        // Blink LED0 (right most one) every second.
        
        //if(TickGet() - d >= TICK_SECOND/16000ul)
        //{
        //    d = TickGet();
        //   	LATDbits.LATD0 ^= 1; // выход STEP
            
        //}
		
		
		
